[
  {
    "source_id": 1,
    "title": "2 Arrested, 50 Kg More Explosives Recovered In Faridabad ... - NDTV",
    "url": "https://www.ndtv.com/video/2-arrested-50-kg-more-explosives-recovered-in-faridabad-day-after-delhi-blast-1020620",
    "content": "The arrests and recoveries were made a day after the police recovered 2,900 kg of explosives and inflammable material from two rented rooms of a Kashmiri doctor, Muzammil Shakeel, in Faridabad. Shakeel and another Kashmiri doctor, Adeel Ahmad Rather, were among eight people who were arrested for allegedly being part of a \"white-collar terror\" module involving the Jaish-e-Mohammed and Ansar Ghazwat-ul-Hind and spanning Jammu and Kashmir, Haryana, and Uttar Pradesh. Show Full;) [...] ### Just Rights for Children x NDTV | Protecting Every Childhood: Bihar's Pledge Against Early Marriage Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 6:55 ### Delhi Blast News | Arrested UP Doctor Was Tasked With Setting Up Jaish's Women Wing In India Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 4:02 ### Inside The White-Collar Terror Web: Doctors Behind The Delhi Blast [...] ### Red Fort Blast News | Arrested UP Doctor Was Tasked With Setting Up Jaish's Women Wing In India Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 43:13 ### Delhi Blast | Hyundai i20 Car Used By Suspected Delhi Suicide Bomber Was Bought, Sold 7 Times Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 6:55 ### Delhi Blast News | Arrested UP Doctor Was Tasked With Setting Up Jaish's Women Wing In India"
  },
  {
    "source_id": 2,
    "title": "Terror plot: Med prof's arrest leads to 2900kg explosives haul in ...",
    "url": "https://timesofindia.indiatimes.com/india/terror-plot-med-profs-arrest-leads-to-2900kg-explosives-haul-in-fbd/articleshow/125237164.cms",
    "content": "An FIR under UAPA, Explosive Substances Act, and Arms Act was filed at Nowgam police station. Tracking the trail led police to what they described as a \"white-collar terror ecosystem\" of radicalised professionals and students allegedly in touch with handlers in Pakistan and other countries. Muzamil Shakeel, 35, a doctor from J&K's Pulwama teaching at Al-Falah University in Faridabad's Dhauj, was arrested October 30 after J&K police linked him to the posters. He managed the university hospital's [...] emergency wing and taught medical students.His questioning led Haryana and J&K police to two rented locations in Dhauj. Searches on Saturday at a room he allegedly took 15 days before his arrest yielded 358kg of suspected ammonium nitrate, a Krinkov assault rifle with three magazines, 83 live cartridges, a pistol, & bomb-making paraphernalia.Cops probing if Faridabad univ lab was used for making RDX Searches on Saturday at a room Muzamil Shakeel allegedly took 15 days before his arrest yielded [...] transnational module linked to JeM and AGuH. Arrests include Arif Nisar Dar alias Sahil and Yasir-ul-Ashraf of Nowgam, Maqsood Ahmad Dar alias Shahid of Nowgam, Molvi Irfan Ahmad of Shopian, Zameer Ahmad Ahanger of Ganderbal, Dr Muzammil Ahmad Ganaie of Koil in Pulwama, and Dr Rather of Kulgam. Searches were carried out across Srinagar, Anantnag, Ganderbal, and Shopian, along with coordinated operations in Faridabad and Saharanpur. \"Financial investigation regarding flow of funds is on and all"
  },
  {
    "source_id": 3,
    "title": "Arrested UP Doctor Was Tasked With Setting Up Jaish's ... - NDTV",
    "url": "https://www.ndtv.com/india-news/dr-shaheena-shahid-jamaat-ul-mominat-india-head-lucknow-doctor-arrested-in-faridabad-terror-module-was-head-of-jaish-e-mohammed-jem-women-wing-in-indi-9613556",
    "content": "Shaheen is reportedly part of Al-Falah University and closely associated with Kashmiri doctor Muzammil Ganaie, alias Musaib, who was arrested after 2,900 kg of explosives and inflammable material were recovered from his two rented rooms in Faridabad. [...] A Lucknow-based woman doctor, arrested in connection with a massive explosives haul in Faridabad near Delhi, was tasked with establishing the women's wing of the Pakistan-based terror group Jaish-e-Mohammed (JeM) in India, according to Delhi Police sources. Dr Shaheen Shahid was handed charge of the India branch of the JeM's women's wing, Jamaat ul-Mominaat, which is headed by JeM founder Masood Azhar's sister Sadia Azhar in Pakistan. [...] Lucknow doctor Shaheena Shahid led Jaish-e-Mohammed's women's wing in India, according to sources She was arrested after the Faridabad explosives haul, and an assault rifle was found in her car Shaheena is linked to Al-Falah University and is an associate of the arrested Kashmiri doctor Muzammil Ganaie Did our AI summary help? Let us know. Switch To Beeps Mode"
  },
  {
    "source_id": 4,
    "title": "J&K terror module busted: Two Kashmiri doctors linked to Jaish,",
    "url": "https://indianexpress.com/article/india/explosives-in-faridabad-doctors-house-transnational-terror-module-busted-j-k-police-probe-10356894/",
    "content": "During interrogation, Dr Muzamil Ahmad Ganai also allegedly confessed to having stored some explosives at his residence in Faridabad, police said. Ganai, a resident of Pulwama, was working in the Emergency Department of Al Falah Hospital in Faridabad. Story continues below this ad [...] Police also said they seized around 3,000 kilograms of explosives, chemicals, reagents, inflammable material, electronic circuits and timers, as well as guns and ammunition, from the module. Among this was 350 kg of explosive material recovered from the Faridabad residence of one of the arrested doctors. Story continues below this ad [...] Connecting the dots According to sources, it started with the investigation into the posters, during which the name of a doctor in Faridabad, Dr Muzamil Ahmad Ganai, came up. “During the examination of CCTV footage, we got some leads that led us to the doctor (Muzamil) at Faridabad,” a source said, adding, “Our team went to Faridabad to arrest him.” Story continues below this ad"
  },
  {
    "source_id": 5,
    "title": "Arrested UP Doctor Was Tasked With Setting Up Jaish's Women ...",
    "url": "https://www.ndtv.com/video/arrested-up-doctor-was-tasked-with-setting-up-jaish-s-women-wing-in-india-1020649",
    "content": "A Lucknow-based woman doctor, arrested in connection with a massive explosives haul in Faridabad near Delhi, was tasked with establishing the women's wing of the Pakistan-based terror group Jaish-e-Mohammed (JeM) in India, according to Delhi Police sources. Dr Shaheen Shahid was handed charge of the India branch of the JeM's women's wing, Jamaat ul-Mominaat, which is headed by JeM founder Masood Azhar's sister Sadia Azhar in Pakistan. Show Full;) ## Related Videos November 11, 2025 8:02 [...] ### Arrested UP Doctor Was Tasked With Setting Up Jaish's Women Wing In India Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 5:27 ### Chandni Chowk Deserted A Day After Red Fort Blast Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 3:58 ### 2 Arrested, 50 Kg More Explosives Recovered In Faridabad Day After Delhi Blast Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 2:21 [...] ### 2 Arrested, 50 Kg More Explosives Recovered In Faridabad Day After Delhi Blast Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 2:21 ### Delhi Blast News | Grief And Shock Outside LNJP As Families Claim Red Fort Blast Victims Bodies Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 4:36 ### Delhi Blast News | New Video Surfaces Of i20 Car Linked To Red Fort Blast Facebook;) Twitter;) WhatsApp;) Reddit;) Copy Link;) November 11, 2025 3:52"
  },
  {
    "source_id": 6,
    "title": "Faridabad terror plot foiled 350 kg of explosives and arms recovered ...",
    "url": "https://www.youtube.com/watch?v=owNkemS_sEY",
    "content": "### Description 21913 views Posted: 10 Nov 2025 A joint operation by the Jammu and Kashmir Police, the Intelligence Bureau, and the Faridabad Police has foiled what could have been a major terror attack near Delhi. Explosives weighing around 350 kg, along with arms and ammunition, were seized from a rented house in Faridabad. Two doctors from Jammu and Kashmir are now under arrest for their suspected involvement in the plot. #terrorattack #faridabad #doctor [...] # Faridabad terror plot foiled 350 kg of explosives and arms recovered, two J&K doctors arrested ## Business Standard 632000 subscribers 118 likes [...] Important Playlists National News: Business News: World News: BS Decoded: Want access to Business Standard’s premium insights? Join our exclusive LinkedIn communities and connect with top voices in the BFSI space—on topics that matter to you! BFSI Circle – Business Standard Reader's Group – Hello viewers! Guess what? We're now on WhatsApp Channels! Dive into real-time news updates, insights, and much more. Follow us: Subscribe to BS Hindi YouTube Channel:"
  },
  {
    "source_id": 7,
    "title": "J&K Doctor With Ammonium Nitrate Arrested Near Delhi",
    "url": "https://www.ndtv.com/india-news/350kg-ammonium-nitrate-explosive-found-with-j-k-doctor-in-faridabad-near-delhi-what-is-ammonium-nitrate-is-ammonium-nitrate-dangerous-9606804",
    "content": "Three hundred and fifty kilograms of ammonium nitrate – an odourless, white crystalline chemical that is a powerful oxidiser and, under the right conditions, can cause a massive explosion – were recovered from Faridabad near Delhi Sunday night, leading to alarm bells around the national capital. [...] ### Opinion | 'PhD' Handlers To Faridabad 'Doctors', How 'White-Collar' Terrorism Isn't New From ISIS chief Abu Bakr al-Baghdadi, who held a PhD, to Al-Qaeda's Ayman al-Zawahiri, a surgeon, and Laden, a civil engineering graduate - some of the world's most extremist leaders have come from classrooms, universities and privileged backgrounds. Read More ### Ammonium Nitrate Fuel Oil Found In Delhi Red Fort Blast. What Is It? [...] Sources said had the recovered amount been detonated (by combining it with an explosive) the blast radius could have ranged from 50 to 100 metres, within a third of which there would have been 'total destruction'. Damage could have been caused to structures even within 120 metres of the explosion."
  },
  {
    "source_id": 8,
    "title": "Doctors of Doom Under Scanner: Investigating Links to Delhi Blast",
    "url": "https://www.instagram.com/p/DQ6YqoYExmy/",
    "content": "[#LinkInBio] 💣🧠 Doctors of Doom under the scanner 🩺 Investigators trace links from the 2,900 kg explosives haul in Faridabad to the Delhi Red Fort blast, revealing shocking details about the arrested doctors’ alleged involvement 🚨 How do professionals get drawn into terror networks this intricate?👇 #Delhi#Faridabad#India#Security#BreakingNews Image 4: justregularaditya's profile picture justregularaditya2h Why tf would you use ai for caption employ copywriters Like Reply [...] Instagram []( Log In Sign Up Image 1: Photo by The Economic Times on November 11, 2025. May be a meme of one or more people, beard, poster and text that says 'From 2,900 kg explosives in in Faridabad to Delhi blast: Who are the doctors arrested and their alleged roles? Read the in-depth story on economictimes.com ET'. Image 2: economictimes's profile picture economictimes • Follow Image 3: economictimes's profile picture economictimes3h [...] Image 19: Photo by The Economic Times on November 11, 2025. May be an image of one or more people, head covering and text that says 'Red Fort blast: The doctor who who was allegedly tasked with creating Jaish's 'white-collar' L women's wing Read the in n-depth story on economictimes.com ET'. See more posts Meta About Blog Jobs Help API Privacy Consumer Health Privacy Terms Locations Instagram Lite Meta AI Meta AI Articles Threads Contact Uploading & Non-Users Meta Verified"
  }
]